import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
class TipsPage extends StatelessWidget {
  const TipsPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text("TIPS",style: GoogleFonts.lato(),),
      ),
      body: Column(
        children: [
          Expanded(
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text("ট্যুরিং বা নিয়মিত কাজের জন্য একজন বাইকারকে হাইওয়ে বরাবর রাইড করতে হয়। "
                    "তাই সেই বাইকারদের, বাইকবিডি হাইওয়ে মোটরসাইকেল চালানোর কিছু প্রয়োজনীয় টিপস দিতে চলেছে।\n "
                    "1.যদি আপনার শহরের এলাকায় রাইড করার অভিজ্ঞতা না থাকে বা আপনি একজন নবাগত হন তাহলে দয়া করে হাইওয়েতে রাইড করার কথা ভাববেন না।\n"
                    "2.হাইওয়ে মানে মুক্ত পথ। কিন্তু মনে রাখবেন যে এটি শুধুমাত্র আপনার জন্য বিনামূল্যের উপায় নয়। এটি বাস, ট্রাক, গাড়ির জন্যও বিনামূল্যের উপায়।\n"
                    "3.মোটরসাইকেল চালাতে ভয় পায় এমন কোনো পেছনের যাত্রীকে নেবেন না। কারণ ওভারটেকিংয়ের মতো কিছু গুরুত্বপূর্ণ মুহূর্তে তারা ভয়ের সাথে কাজ করতে পারে এবং আপনাকে বড় বিপদে ফেলতে পারে।\n"
                    "4. যদি আপনি রাস্তার মাঝখানে একজন পুরুষকে রাস্তা পাড়ি দিতে ইতস্তত করতে দেখেন তাহলে সঠিক নির্দেশিত আলো, পাসের আলো এবং আপনার হেড সিগন্যাল ব্যবহার করে পুরুষ বা মহিলার পিছনের দিক দিয়ে সাইকেলটি পাস করুন। পিছনের দিক কারণ মানুষ দ্রুত এগিয়ে যেতে পছন্দ করে না বরং পিছিয়ে যায়।\n"
                    "5. যারা রাস্তা পার হওয়ার চেষ্টা করছেন তাদের সাথে চোখের যোগাযোগ গুরুত্বপূর্ণ বিষয়। যারা তার অভিনয় দ্বারা রাস্তা পার হতে চায় তাদের মন পড়ুন এবং তারপর তার চাল অনুযায়ী কাজ করুন।\n"
                    "6. আপনার স্পিডোমিটারে যখন 100 কিমি প্রতি ঘণ্টা গতিতে কোনো যানবাহনকে অতিক্রম করার চেষ্টা করবেন না Ymaha R15 ব্যতীত অন্য মোটরসাইকেল বাংলাদেশে স্বল্প সময়ে বেশি গতি অর্জন করা কঠিন। কারণ মহাসড়ক সবসময় ব্যস্ত থাকে। তাই গড় গতি বজায় রাখুন এটি আপনাকে যেকোনো বাজার বা জ্যামে গাড়িটিকে ওভারটেক করতে সাহায্য করবে।\n",style: GoogleFonts.lato(fontSize: 14),
                    // "7. সামনের গাড়িতে কখনই আপনার বাইকে উচ্চ গতিতে ঘাড় থেকে ঘাড় চালাবেন না। কারণ গাড়ির জোরে ব্রেক করলে বাইক ঠিকমতো থামাতে পারবেন না। আঘাত এড়াতে ন্যূনতম 100 ফুট ব্যবধান বজায় রাখুন।/n"
                  // "8. সামনের গাড়ির বিরল চাকার মাঝের লাইনে কখনই আপনার বাইক চালাবেন না। কারণ ঝাঁকুনি এড়াতে সেখানে সর্বোচ্চ যানবাহনের চাকা বড় গর্তের ওপর দিয়ে চলে। তাই মাঝের লাইন অনুসরণ করলে গর্ত বা ভাঙা রাস্তায় পড়ে যেতে পারেন। উচ্চ গতিতে আপনি আপনার নিয়ন্ত্রণ হারাতে পারেন।"
                ),
              ),
            ),
          )
        ],
      ),
    );
  }
}
